# InitialIntensity Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InitialIntensity Class
Members See Also
---
This class is the base class for calculating lighting initial intensity.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class InitialIntensity : IDisposable
```

Visual Basic
---
```text
Public Class InitialIntensity _
	Implements IDisposable
```

Visual C++
---
```text
public ref class InitialIntensity : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..InitialIntensity Autodesk.Revit.DB.Lighting..::..InitialFluxIntensity Autodesk.Revit.DB.Lighting..::..InitialIlluminanceIntensity Autodesk.Revit.DB.Lighting..::..InitialLuminousIntensity Autodesk.Revit.DB.Lighting..::..InitialWattageIntensity
# See Also
InitialIntensity Members
Autodesk.Revit.DB.Lighting Namespace